from pprint import pprint

# У вас є словник зі студентами, де ключ — це tuple (ім’я, прізвище), а значення — словник із додатковою інформацією:
#
# Пошта
#
# Вік
#
# Середній бал
#
# Номер телефону
#
# Додати кількох студентів у словник (використати tuple як ключ).
#
# Вивести список усіх студентів, у яких середній бал більше 85.
#
# Створити список лише з кортежів (ім’я, прізвище) студентів, у яких немає номера телефону.
#
# Знайти найстаршого студента у групі (вивести його ім’я, прізвище та вік).

student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}

new_students = {
    'John Lenon': {
        'Пошта': 'JL@gmail.com',
        'Вік': 54,
        'Номер телефону': '+380689771221',
        'Середній бал': 56
    },
    'Chris Brown': {
        'Пошта': 'CB@gmail.com',
        'Вік': 34,
        'Номер телефону': '+380977771221',
        'Середній бал': 30
    },
}

student = student | new_students
pprint(student)
age_list = []

for person, value in student.items():
    if value['Середній бал'] > 85:
        print(f'середній бал більше 85 - {person}')
    if value['Номер телефону'] is None:
        print(f'студенти, у яких немає номера телефону - {person}')
    age_list.append(value['Вік'])

for person, value in student.items():
    if value['Вік'] == max(age_list):
        print(f"найстарший студент у групі - {person} : {value['Вік']} років")


# for person, values in list(student.items()).sort():
#     # if max(value['Вік']):
#     #     # print(f"найстарший студент у групі - {person} : {value['Вік']} років")
