# Додати нового студента у словник students з ім’ям 'Олег Литвин', віком 17, поштою 'Oleg@gmail.com',
# номером телефону '+380991112233' та середнім балом 88.
# Після цього вивести оновлений список студентів.

students = {
  'Іван Петров': {
    'Пошта': 'Ivan@gmail.com',
    'Вік': 14,
    'Номер телефону': '+380987771221',
    'Середній бал': 95.8
  },
  'Женя Курич': {
    'Пошта': 'Geka@gmail.com',
    'Вік': 16,
    'Номер телефону': None,
    'Середній бал': 64.5
  },
  'Маша Кера': {
    'Пошта': 'Masha@gmail.com',
    'Вік': 18,
    'Номер телефону': '+380986671221',
    'Середній бал': 80
  },
}

new_key = 'Олег Литвин'
new_set_value = {'Пошта': 'Oleg@gmail.com',
    'Вік': 17,
    'Номер телефону': '+380991112233',
    'Середній бал': 88}
students[new_key] = new_set_value
print(students)

# students['Олег Литвин'] = {
#     'Пошта': 'Oleg@gmail.com',
#     'Вік': 17,
#     'Номер телефону': '+380991112233',
#     'Середній бал': 88
# }
#
# print(students)
