# Вивести список усіх електронних адрес студентів, у яких є вказаний номер телефону (не None).
students = {
  'Іван Петров': {
    'Пошта': 'Ivan@gmail.com',
    'Вік': 14,
    'Номер телефону': '+380987771221',
    'Середній бал': 95.8
  },
  'Женя Курич': {
    'Пошта': 'Geka@gmail.com',
    'Вік': 16,
    'Номер телефону': None,
    'Середній бал': 64.5
  },
  'Маша Кера': {
    'Пошта': 'Masha@gmail.com',
    'Вік': 18,
    'Номер телефону': '+380986671221',
    'Середній бал': 80
  },
}
emails_with_phone = [info['Пошта'] for info in students.values() if info['Номер телефону'] is not None]

print("Електронні адреси студентів з номером телефону:")
for email in emails_with_phone:
    print(email)