# по всім написаним нижче функціям потрібно
#
# написати тести (перевірка на тип отриманого значення, передача різних типів даних, очікувані помилки - на кожну функцію
# має бути не менше 5 тестів. при передачі чисел перевіряйте як негативні, так і 0, так і позитивні)
# перевірити файл з бібліотекою, де написані функції, та файл з тестами модулями mypy and flake8 (до дз прикріпити скрин
# консолі з пройденими тестами)
# запустити тести та зробити принтскрін консолі з пройденими тестами
# щодо написання функцій:
#
# написати функцію, яка конвертує милі (сухопутні, НЕ морські) в кілометри (ітн та флоат на вході, інт та флоат на виході,
# при передачі відємного значення рейзимо ValueError)
# написати функцію, яка отримує якусь множину (ліст, сет, стрічку, дікт), і повертає відсортований тапл унікальних
# елементів (для дікта це мають бути ключі, для стрічки - букви). перевірте, що значення реально будуть відсортовані).
# рекомендація - відсортуйте список і конвертніть його в тапл

