from pprint import pprint


# """
# зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку
# здійснюється за механізмом
# student[outer_dict_key][inner_dict_key]
#
# Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
# 1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення,
#     бал від 0 до 100 (інт чи флоат)
# 2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
#     сам формат наповнення цього списку up to you
# 3 - визначити середній бал по групі
# 4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)
#
# не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
# """

student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}
# ваш код нижче
new_student = {
    'Ilon Mask': {
        'Пошта': 'IM@gmail.com',
        'Вік': 40,
        'Номер телефону': '+380633448944',
        'Середній бал': 98
    },
}
student = student | new_student
pprint(student)

for name, value in student.items():
    if value['Середній бал'] > 90:
      print(f"Name: {name} - Points: {value['Середній бал']}")

total = 0
for value in student.values():
    total += value['Середній бал']

avg = total/len(student)

print(f'Average Point is {avg}')

for values in student.values():
    if values['Номер телефону'] is None:
        values['Номер телефону'] = 'Parents phone'

pprint(student)

# student_list = [(f"Name: {name}, - Ponts: {value['Середній бал']}") for name, value in student.items() if value['Середній бал'] > 90]
# print(student_list)
