# написатьи функцію, яка приймає ціле позитивне число, а повертає список з чисел, довжиною 10 значень, сформованих ліст
# компрехенширом, причому кожне число на 1 більше від попереднього. отриманий аргумент є стартовим значенням. якщо число
# менше одиниці, рейзимо помилку ValueError
#
# наприклад
#
# передали 5, отримали [5,6,7,8,9,10,11,12,13,14]
#
# передали 1, отримали [1.2.3.4.5.6.7.8.9.10]

def get_positive_num(start: int) -> list:
    if start <= 0:
        raise ValueError
    return [start + num for num in range(10) if start > 0]
    # return [num for num in range(start, start + 10)]

print(get_positive_num(1))

